package com.company.exercises;

//  Объявить класс Person для описания сотрудника с полями: ФИО, возраст, вес,
//  номер разряда (целое число от 1 до 5). Прописать конструкторы, сеттеры, геттеры
//  для записи значений по сотруднику и считывания данных.
//  Обеспечить корректность представления данных:
//  возраст и вес - положительные числа в пределах [30; 200];
//  разряд в диапазоне [1;5];
//  в ФИО могут использоваться только буквенные символы, пробел и дефис.
//  Создать несколько таких объектов и убедиться в их корректной работе.

public class Podvig1_14 {
}
