package com.company.java18.podvig2;

// требуется создать описание окна приложения для разных устройств: смартфонов, планшетов и настольных компьютеров (декстопов).
// Окно имеет общие параметры: заголовок, шрифт, наличие/отсутсвие рамки. И уникальные для каждого устройства:
// для сфартфонов: ничего (все берется из базового класса)
// для планшетов: положение и размер окна:
// для декстопов: положение и размер окна, возможность менять размеры, полноэкранный режим.
// Подумайте, как описать эти классы. СОздайте экземпляры классов для каждого устройства и выведите значение полей в консоль.
public class Main {
}
