package com.company;//package com.company;
//
//import java.awt.*;
//import java.util.Scanner;
//import java.lang.Object;
//
//import static java.lang.Math.*;
//
//// Создайте супер класс Shape и его наследники Circle, Rectangle.
//// Класс Shape содержит абстрактный метод draw() и переменную хранящую цвет.
//// Классы Circle, Rectangle содержат координаты точек.
//// Создать массив содержащий эти фигуры.
//// В цикле нарисовать их (вызвать метод draw).
//// Добавить метод equals() для классов Shape, Circle, Rectangle.
//public class Shape {
//    public static void main(String[] args) {
//        //Circle[] arr = new Circle[3];
//        Rectangle re = new Rectangle();
//        Scanner in = new Scanner(System.in);
//        System.out.print("Введите точку x для прямоугольника: ");
//        x = in.nextInt();
//        System.out.print("Введите точку y для прямоугольника: ");
//        y = in.nextInt();
//
//
//    }
//
//    //    abstract class drow{
////        abstract String
////}
//    static void Rectangle() {
//        int n = 10;
//        for (int i = 0; i <= n; ++i)
//            for (int j = 0; j <= n; ++j) {
//                if (i == 0 || j == 0 || i == n || j == n) System.out.println("* ");
//                else System.out.println(" ");
//            }
//
//    }
//
//}
